{
  "schema_version": "1.4.0",
  "id": "GHSA-pc9j-5v36-2mww",
  "modified": "2026-01-08T22:12:15Z",
  "published": "2026-01-08T22:12:15Z",
  "aliases": [],
  "summary": "AWS SDK for Swift adopted defense in depth enhancement for region parameter value",
  "details": "CVSSv3.1 Rating: 3.7 (LOW)\n\nSummary\nThis notification is related to the use of specific values for the region input field when calling AWS services. An actor with access to the environment in which the SDK is used could set the region input field to an invalid value.\n\nA defense-in-depth enhancement has been implemented in the AWS SDK for Swift. This enhancement validates that a region used to construct an endpoint URL is a valid host label. The change was released on November 6, 2025. This advisory is informational to help customers understand their responsibilities regarding configuration security.\n\nImpact\nCustomer applications could be configured to improperly route AWS API calls to non-existent or non-AWS hosts. While the SDK was functioning safely within the requirements of the shared responsibility model, additional safeguards have been added to support secure customer implementations.\n\nImpacted versions: All versions prior to 2025-11-06 release (below 1.5.79) \n\nPatches\nOn November 6, 2025 an enhancement was made to the AWS SDK for Swift release, which validates the formatting of a region, providing additional safeguards.\n\nWorkarounds\nNo workarounds are needed, but as always you should ensure that your application is following security best practices:\n- Implement proper input validation in your application code\n- Update to the latest AWS SDK for Swift release on a regular basis\n- Follow AWS security best practices [1] for SDK configuration\n\nReferences\nContact AWS Security via the vulnerability reporting page or email [aws-security@amazon.com](mailto:aws-security@amazon.com).\n\nAcknowledgement\nAWS SDK thanks Guy Arazi for bringing these customer security considerations to our attention through the coordinated disclosure process.\n\n \n\n[1] https://docs.aws.amazon.com/sdk-for-swift/latest/developer-guide/security.html",
  "severity": [
    {
      "type": "CVSS_V3",
      "score": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N"
    }
  ],
  "affected": [
    {
      "package": {
        "ecosystem": "SwiftURL",
        "name": "github.com/awslabs/aws-sdk-swift"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.5.79"
            }
          ]
        }
      ]
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/awslabs/aws-sdk-swift/security/advisories/GHSA-pc9j-5v36-2mww"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/awslabs/aws-sdk-swift"
    }
  ],
  "database_specific": {
    "cwe_ids": [
      "CWE-20"
    ],
    "severity": "LOW",
    "github_reviewed": true,
    "github_reviewed_at": "2026-01-08T22:12:15Z",
    "nvd_published_at": null
  }
}